## Decision Analytics Final Project
### Question: What is the best combination of tourist attractions in NYC that a travel agency can put together in order to provide the best tour experience? 
#### Team Members: Megan, Jhanvi, Hannah, Kaia

In [1]:
import numpy as np
from gurobipy import *
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
survey_table = pd.read_csv("survey_final_table.csv")
nyc = pd.read_csv("nyc attractions.csv")

In [5]:
# Load the survey results table
survey_table.head()

,Unnamed: 0,Group,Proba,Nature,Museum,Family,Activity,Walking,Theatre,Landmarks
0,0,3.0,0.25,3.800000,2.000000,3.400000,4.400000,3.000000,2.400000,2.800000
1,1,2.0,0.20,1.000000,3.750000,3.000000,1.250000,2.250000,3.500000,3.000000
2,2,1.0,0.30,4.333333,3.666667,3.166667,1.833333,4.166667,3.333333,1.333333
3,3,0.0,0.25,5.000000,3.200000,1.800000,4.200000,2.600000,3.200000,1.400000

In [6]:
# Load the NYC tourist attraction category table
nyc.head()

,AttractionID,AttractionName,CostPerVisit,Nature,Museum,Landmark,FamilyFriendly,Active,Arts,Unnamed: 9,Level,Meaning
0,1,Central Park,0.0,3,2,3,3,3,2,NaN,1.0,No relevance
1,2,The National 9/11 Memorial & Museum,33.0,1,3,2,2,1,2,NaN,2.0,Some relevance
2,3,The Metropolitan Museum of Art,30.0,1,3,2,2,1,3,NaN,3.0,High relevance
3,4,Empire State Building,79.0,1,1,3,3,1,1,NaN,NaN,NaN
4,5,The High Line,0.0,3,1,3,3,3,1,NaN,NaN,NaN

In [7]:
# Clean up table
columns_drop = ['Unnamed: 9' ,  'Level ', 'Meaning']
nyc = nyc.drop(columns=columns_drop)

In [8]:
nyc.head()

,AttractionID,AttractionName,CostPerVisit,Nature,Museum,Landmark,FamilyFriendly,Active,Arts
0,1,Central Park,0.0,3,2,3,3,3,2
1,2,The National 9/11 Memorial & Museum,33.0,1,3,2,2,1,2
2,3,The Metropolitan Museum of Art,30.0,1,3,2,2,1,3
3,4,Empire State Building,79.0,1,1,3,3,1,1
4,5,The High Line,0.0,3,1,3,3,3,1

In [9]:
# Clean up survey table
survey_table_short = survey_table.drop(labels=['Unnamed: 0', 'Group', 'Proba', 'Walking'], axis=1)
survey_table_short

     Nature    Museum    Family  Activity   Theatre  Landmarks
0  3.800000  2.000000  3.400000  4.400000  2.400000   2.800000
1  1.000000  3.750000  3.000000  1.250000  3.500000   3.000000
2  4.333333  3.666667  3.166667  1.833333  3.333333   1.333333
3  5.000000  3.200000  1.800000  4.200000  3.200000   1.400000

In [19]:
attractions1 = nyc.to_dict()

#### Calculate the dot product of survey table responses and attraction relevance score so that we can get the happiness score of each attraction for each group

In [13]:
# Clean up the NYC table and make sure the order of the columns of two tables match so that it can be used to dot product
nyc_short = nyc[['Nature', 'Museum ', 'FamilyFriendly', 'Active', 'Arts', 'Landmark']]
nyc_short.head()

   Nature  Museum   FamilyFriendly  Active  Arts  Landmark
0       3        2               3       3     2         3
1       1        3               2       1     2         2
2       1        3               2       1     3         2
3       1        1               3       1     1         3
4       3        1               3       3     1         3

In [ ]:
attraction_user_product = np.dot(nyc_short, survey_table_short.T)
attraction_user_product

array([[52.        , 39.25      , 46.        , 50.        ],
       [31.4       , 32.5       , 32.83333333, 31.6       ],
       [33.8       , 36.        , 36.16666667, 34.8       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [47.6       , 32.        , 39.        , 43.6       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [35.        , 28.5       , 31.        , 30.2       ],
       [27.8       , 24.5       , 23.5       , 23.4       ],
       [27.        , 25.5       , 27.5       , 27.        ],
       [30.2       , 28.        , 26.83333333, 26.6       ],
       [37.4       , 32.        , 34.33333333, 33.4       ],
       [41.        , 40.        , 43.66666667, 41.6       ],
       [32.2       , 25.5       , 29.66666667, 28.8       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [27.8       , 24.5       , 23.5       , 23.4       ],
       [32.2       , 31.75      , 30.5       , 29.8       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [37.2       , 39.        , 39.33333333, 36.6       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [43.8       , 31.        , 34.66666667, 38.6       ],
       [34.4       , 36.        , 38.        , 35.2       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [31.2       , 27.5       , 26.66666667, 25.2       ],
       [43.8       , 31.        , 34.66666667, 38.6       ]])

The above matrix demonstrate the composite "attraction score" of each tourist site for each tourist group archetype. For example, the first number 52 is the attraction score of central park for Group 0 (Adventurers). It is calculated by SUM(category i preferences score * this site's relevance to category i).

### Optimization

In [34]:
# Parameters
budget = 5000  # Total budget constraint
#max_at = 10  # Maximum attractions to visit 
demographic_weights = [0.25, 0.20, 0.30, 0.25]  # Example weights for demographic groups
t = 8*7 # Max available travel time for a 7-day trip

In [39]:
# Initialize Model
import numpy as np
from gurobipy import *
import pandas as pd

model = Model("NYC_Tour_Optimization")

In [41]:
## Decision variables
# Stage 1 decision varable: A (decide on a max number of attractions)
A = model.addVar(vtype=GRB.INTEGER, name="A") 
# Stage 2 decision variable: a (decide on which attraction to go to)
a = model.addVars(24, vtype=GRB.BINARY, name="a")

In [43]:
# Objective Function
model.setObjective(quicksum(demographic_weights[j] * a[i] * attraction_user_product[i][j] for i in range(24) for j in range(3)), GRB.MAXIMIZE)

### Constraints ###

# Time Constraint
model.addConstr(
    A*4<=t, "Time"
)

# Budget Constraint
model.addConstr(
    quicksum(a[i] * nyc["CostPerVisit"][i] for i in range(24)) <= budget, "Budget"
)

# Total no.of attractions Constraint 
model.addConstr(
    quicksum(a[i] for i in range(24)) <= A, "Duration"
)

# Constraints for specific categories
#categories = ['Nature', 'Museum ', 'FamilyFriendly', 'Active', 'Arts', 'Landmark']
#category_min_ratios = [0.15, 0.15 , 0.4, 0.15, 0.1, 0.05 ]  # Additional Constraint

#for category, min_ratio in zip(categories, category_min_ratios):
#    model.addConstr(
#        quicksum(a[i] * attractions1[i + 1][category] for i in range(24)) 
#        >= min_ratio * quicksum(a[i] for i in range(24)), f"{category}_Constraint"
#    )

# Pairwise Constraints (e.g., cannot select both Central Park and 9/11 Memorial)
#model.addConstr(A[0] + A[1] <= 1, "Pairwise_Constraint")

# Optimize
model.optimize()

# Print Results
if model.status == GRB.OPTIMAL:
    selected_attractions = [i + 1 for i in range(24) if a[i].X > 0.5]
    print("Optimal Attractions:", selected_attractions)
    print("Maximum Happiness:", model.objVal)
else:
    print("No optimal solution found.")

Gurobi Optimizer version 11.0.3 build v11.0.3rc0 (win64 - Windows 11.0 (22631.2))

CPU model: 13th Gen Intel(R) Core(TM) i7-1360P, instruction set [SSE2|AVX|AVX2]
Thread count: 12 physical cores, 16 logical processors, using up to 16 threads

Optimize a model with 6 rows, 25 columns and 72 nonzeros
Model fingerprint: 0x123082ba
Variable types: 0 continuous, 25 integer (24 binary)
Coefficient statistics:
  Matrix range     [1e+00, 1e+02]
  Objective range  [2e+01, 3e+01]
  Bounds range     [1e+00, 1e+00]
  RHS range        [6e+01, 5e+03]

MIP start from previous solve did not produce a new incumbent solution
MIP start from previous solve violates constraint Time by 56.000000000

Found heuristic solution: objective -0.0000000
Presolve removed 6 rows and 25 columns
Presolve time: 0.00s
Presolve: All rows and columns removed

Explored 0 nodes (0 simplex iterations) in 0.02 seconds (0.00 work units)
Thread count was 1 (of 16 available processors)

Solution count 2: 374.6 -0

Optimal solution found (tolerance 1.00e-04)
Best objective 3.746000000000e+02, best bound 3.746000000000e+02, gap 0.0000%
Optimal Attractions: [1, 2, 3, 5, 7, 11, 12, 13, 16, 17, 18, 20, 21, 24]
Maximum Happiness: 374.59999999999997